# JOIN TABLES

In [1]:
import pandas as pd

In [3]:
df1 = pd.DataFrame({"user_id":[1,1,3,4,5,6,7,8],
                    "shop_id":[1,1,1,2,1,1,2,1],
                    "product_id":[1,4,3,6,7,8,9,1]})

In [4]:
df2 = pd.DataFrame({"user_id":[12,10,3,15,20,5,7,8],
                    "shop_id":[3,3,1,2,1,1,2,1],
                    "product_id":[1,10,3,6,4,8,12,1]})

In [5]:
product = pd.DataFrame({"product_id":[1,2,3,4,5,6,7,1],
                        "storage_id":[1,1,1,2,1,1,2,5]})

In [13]:
df1

   user_id  shop_id  product_id
0        1        1           1
1        1        1           4
2        3        1           3
3        4        2           6
4        5        1           7
5        6        1           8
6        7        2           9
7        8        1           1

In [7]:
df1.shape

(8, 3)

In [11]:
product

   product_id  storage_id
0           1           1
1           2           1
2           3           1
3           4           2
4           5           1
5           6           1
6           7           2
7           1           5

In [12]:
product.shape

(8, 2)

In [6]:
df1_merge = df1.merge(product, on='product_id', how='left')

In [8]:
df1_merge.shape

(10, 4)

In [9]:
df1_merge

   user_id  shop_id  product_id  storage_id
0        1        1           1         1.0
1        1        1           1         5.0
2        1        1           4         2.0
3        3        1           3         1.0
4        4        2           6         1.0
5        5        1           7         2.0
6        6        1           8         NaN
7        7        2           9         NaN
8        8        1           1         1.0
9        8        1           1         5.0

In [14]:
df1_merge2 = df1.merge(product, on='product_id', how='inner')

In [15]:
df1_merge2.shape

(8, 4)

In [16]:
df1_merge2

   user_id  shop_id  product_id  storage_id
0        1        1           1           1
1        1        1           1           5
2        8        1           1           1
3        8        1           1           5
4        1        1           4           2
5        3        1           3           1
6        4        2           6           1
7        5        1           7           2